{
    "posts": [
        {
            "id": 1,
            "categoryId": 6,
            "userId": 1,
            "image_url": "https://as2.ftcdn.net/v2/jpg/06/07/42/03/1000_F_607420392_LdFuxthRw7OKYw8CFjBgr5aXDBy5Gu5r.jpg",
            "title": "Quis sit non dolore pariatur qui minim pariatur ipsum est veniam sunt culpa cupidatat.",
            "content": "Do ipsum laborum dolore elit cillum elit ea non. Mollit enim occaecat incididunt tempor commodo deserunt consequat eu occaecat aute occaecat culpa. Consectetur ipsum nostrud irure dolor excepteur esse sunt.\r\n",
            "created_at": "2015-07-28T12:11:39 +03:00"
        },
        {
            "id": 2,
            "categoryId": 1,
            "userId": 4,
            "image_url": "https://as2.ftcdn.net/v2/jpg/00/18/60/75/1000_F_18607589_fKOPX0dQKLcKRPKWwzkcmtZsbftqk5xF.jpg",
            "title": "Dolor excepteur irure ipsum minim.",
            "content": "Occaecat enim eu tempor excepteur. Incididunt laboris velit aute commodo amet ullamco dolor officia non tempor. Anim non id excepteur voluptate irure laborum in.\r\n",
            "created_at": "2022-12-07T07:50:08 +03:00"
        },
        {
            "id": 3,
            "categoryId": 6,
            "userId": 1,
            "image_url": "https://as2.ftcdn.net/v2/jpg/00/67/27/69/1000_F_67276977_nPSOEwTNowVhyZdHXWn8DXMbiDVZE48s.jpg",
            "title": "Adipisicing velit ea et pariatur officia duis ut sit aliquip.",
            "content": "Consequat aliqua eu veniam veniam elit pariatur qui anim. Voluptate dolore adipisicing veniam sint enim qui qui sit mollit non in. Pariatur tempor pariatur dolore id et culpa et sunt enim esse et velit. Non reprehenderit ad labore ipsum sint velit laborum ullamco. Adipisicing culpa aliquip mollit enim duis id veniam sint anim. Lorem incididunt tempor irure occaecat exercitation deserunt amet in excepteur veniam mollit duis consectetur consequat. Occaecat aliqua ipsum culpa cupidatat ipsum laborum minim duis voluptate tempor incididunt duis veniam.\r\n",
            "created_at": "2014-04-30T01:14:49 +03:00"
        },
        {
            "id": 4,
            "categoryId": 3,
            "userId": 3,
            "image_url": "https://as2.ftcdn.net/v2/jpg/06/07/42/03/1000_F_607420392_LdFuxthRw7OKYw8CFjBgr5aXDBy5Gu5r.jpg",
            "title": "Esse non anim adipisicing irure mollit eiusmod voluptate elit commodo fugiat nisi incididunt.",
            "content": "Eiusmod adipisicing incididunt est et nulla irure ut mollit reprehenderit id. Irure elit et velit dolore consectetur duis. Eiusmod nulla laboris proident proident.\r\n",
            "created_at": "2016-04-03T11:36:49 +03:00"
        },
        {
            "id": 5,
            "categoryId": 4,
            "userId": 2,
            "image_url": "",
            "title": "Sint do ex enim officia adipisicing sit deserunt laborum anim laborum.",
            "content": "Fugiat ea nisi deserunt et labore aliquip. Velit occaecat culpa aliqua proident. Cupidatat consequat sint labore aute irure mollit sunt proident est ea nisi. In amet esse pariatur quis ipsum eiusmod. Officia voluptate incididunt sunt qui culpa nostrud cillum anim. Ex tempor magna proident eiusmod ut proident laborum tempor cillum irure.\r\n",
            "created_at": "2022-11-12T11:09:04 +03:00"
        },
        {
            "id": 6,
            "categoryId": 5,
            "userId": 3,
            "image_url": "https://as2.ftcdn.net/v2/jpg/00/18/60/75/1000_F_18607589_fKOPX0dQKLcKRPKWwzkcmtZsbftqk5xF.jpg",
            "title": "Fugiat aliqua ad ipsum mollit excepteur.",
            "content": "Exercitation enim non qui veniam magna id tempor esse reprehenderit anim dolor tempor sunt. Adipisicing tempor aute magna aliqua aute ad commodo ea voluptate ad tempor. Qui officia consequat ullamco tempor magna enim culpa magna incididunt eu excepteur amet dolore. Non sint qui minim aliquip cillum aliquip.\r\n",
            "created_at": "2023-07-20T12:31:17 +03:00"
        }
    ],
    "comments": [
        {
            "id": 1,
            "postId": 6,
            "userId": 1,
            "content": "Sint ex sunt qui mollit culpa dolore dolor. Cupidatat ea culpa voluptate velit dolore laborum. Anim consectetur aute est do eu quis quis quis qui ea ullamco dolore laboris. Excepteur qui officia qui velit pariatur et. Pariatur occaecat ipsum esse labore mollit culpa incididunt irure occaecat aliquip in enim. Aliqua labore deserunt anim nisi labore minim tempor occaecat veniam.\r\n",
            "created_at": "2022-08-13T06:28:54 +03:00"
        },
        {
            "id": 2,
            "postId": 3,
            "userId": 3,
            "content": "Officia est eu irure tempor sint. Proident duis anim elit consectetur officia nisi sunt esse pariatur eiusmod cillum. Occaecat reprehenderit laboris cillum culpa tempor deserunt incididunt ut. In consequat labore adipisicing non aliqua fugiat.\r\n",
            "created_at": "2015-05-18T09:45:31 +03:00"
        },
        {
            "id": 3,
            "postId": 5,
            "userId": 4,
            "content": "Adipisicing nulla sint tempor dolor culpa elit cillum ea. Consequat aute nisi exercitation labore dolore laborum cupidatat incididunt ipsum ad in duis. Dolore labore excepteur anim do eu id. Minim amet do pariatur magna aute magna. Anim laborum dolor laborum adipisicing consequat qui. Est in mollit aliqua incididunt eiusmod irure officia ea sit reprehenderit elit minim. Qui officia excepteur sint sit nostrud proident fugiat.\r\n",
            "created_at": "2014-10-01T05:39:59 +03:00"
        },
        {
            "id": 4,
            "postId": 4,
            "userId": 3,
            "content": "Ad mollit eu tempor ipsum commodo. Enim sit reprehenderit ullamco sit sit ea ullamco. Nulla mollit mollit mollit esse eiusmod sint dolore qui. Qui aute tempor et qui eiusmod consequat dolor culpa deserunt in qui. Dolore eu do pariatur aute cillum nisi aliquip nostrud enim ex sit dolore fugiat ea. Veniam cupidatat veniam cupidatat reprehenderit exercitation dolore incididunt incididunt exercitation fugiat aliquip. Velit fugiat incididunt non voluptate fugiat consequat.\r\n",
            "created_at": "2022-02-06T10:08:11 +03:00"
        },
        {
            "id": 5,
            "postId": 4,
            "userId": 3,
            "content": "Deserunt duis aliqua id dolor cupidatat esse deserunt exercitation sit voluptate dolor sint id. Ad id aliqua nostrud proident amet do deserunt proident ad anim commodo est nulla et. Cupidatat minim amet aute culpa ad dolor eu deserunt anim. Magna fugiat amet tempor est dolor Lorem quis tempor sint reprehenderit. Eu sunt fugiat irure enim consectetur. Ipsum et ex esse laborum nostrud.\r\n",
            "created_at": "2018-08-11T08:04:53 +03:00"
        },
        {
            "id": 6,
            "postId": 3,
            "userId": 3,
            "content": "Et veniam ullamco esse dolore minim ipsum velit irure. Do dolore irure ex cupidatat et voluptate consequat nulla. Et qui non enim enim sunt elit dolore ea amet laborum. Pariatur veniam id deserunt aliquip quis amet est fugiat ullamco minim aute fugiat mollit. Exercitation elit fugiat pariatur ad ipsum dolore nisi laborum consequat enim velit fugiat.\r\n",
            "created_at": "2022-05-07T12:16:44 +03:00"
        },
        {
            "id": 7,
            "postId": 2,
            "userId": 1,
            "content": "Mollit laboris sunt mollit eiusmod. Aliquip occaecat exercitation consectetur proident esse dolore fugiat velit aliqua Lorem labore id. Veniam ad proident est proident dolore culpa exercitation cillum duis dolor aliqua fugiat dolore duis. Laboris magna eu do incididunt tempor duis non aliquip deserunt culpa. Elit in dolore reprehenderit dolor elit cillum. Laborum cillum amet exercitation adipisicing Lorem cupidatat irure aute nulla Lorem eu eu. Duis in et id Lorem dolor quis labore velit esse sit aliqua sunt duis.\r\n",
            "created_at": "2022-01-25T10:21:32 +03:00"
        }
    ],
    "users": [
        {
            "id": 1,
            "username": "cleyton",
            "email": "cleyton@gmail.com",
            "name": "Cleyton",
            "password": "senhaNova",
            "photo": "https://github.com/MatheusNascimentoti99/Conexa-DB-Json/assets/32804625/ec3daccd-e799-4233-bf86-1e6414d25d13",
            "created_at": "2023-07-30T11:05:11Z"
        },
        {
            "id": 2,
            "username": "lucas",
            "name": "Lucas",
            "email": "lucas@gmail.gom",
            "password": "alohomora",
            "photo": null,
            "created_at": "2023-07-31T10:30:11Z"
        },
        {
            "id": 3,
            "username": "bruna.santos",
            "email": "bruna@conexa.com",
            "name": "Bruna Santos",
            "password": "senhaNova",
            "photo": "https://github.com/MatheusNascimentoti99/Conexa-DB-Json/assets/32804625/7021906d-726a-4ac4-a6e6-50060d239f82",
            "created_at": "2023-07-30T11:05:11Z"
        },
        {
            "id": 4,
            "username": "ana",
            "email": "ana@conexa.com",
            "name": "Ana Maria",
            "password": "senhaNova",
            "photo": "https://github.com/MatheusNascimentoti99/Conexa-DB-Json/assets/32804625/7021906d-726a-4ac4-a6e6-50060d239f82",
            "created_at": "2023-07-30T11:05:11Z"
        }
    ],
    "categories": [
        {
            "id": 1,
            "name": "Integrações"
        },
        {
            "id": 2,
            "name": "Serviços"
        },
        {
            "id": 3,
            "name": "Financeiro"
        },
        {
            "id": 4,
            "name": "Agenda"
        },
        {
            "id": 5,
            "name": "Parceiros"
        },
        {
            "id": 6,
            "name": " Outros"
        }
    ]
}